// Lab_32.cpp
// < Грушка Олександр >
// Лабораторна робота № 3.2
// Розгалуження, задане формулою: функція з параметрами.
// Варіант 5

#include <iostream>

using namespace std;

int main() {
    double x; // вхідний аргумент
    double a; // вхідний параметр
    double b; // вхідний параметр
    double c; // вхідний параметр
    double F; // результат обчислення

    cout << "a = "; cin >> a;
    cout << "b = "; cin >> b;
    cout << "c = "; cin >> c;
    cout << "x = "; cin >> x;

    // --- Спосіб 1: розгалуження в скороченій формі ---
    if (x < 0 && b == 0)
        F = a - x / (10.0 + b);

    if (x > 0 && b != 0)
        F = (x - c) / (a - c);

    if (!(x < 0 && b == 0) && !(x > 0 && b != 0))
        F = 3.0 * x + 2.0 / b;

    cout << endl;
    cout << "1) F = " << F << endl;

    // --- Спосіб 2: розгалуження в повній формі ---
    if (x < 0 && b == 0)
        F = a - x / (10.0 + b);
    else if (x > 0 && b != 0)
        F = (x - c) / (a - c);
    else
        F = 3.0 * x + 2.0 / b;

    cout << "2) F = " << F << endl;

    return 0;
}