// Lab_03.1.cpp
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 5

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    double x; // вхідний параметр
    double y; // результат обчислення виразу
    double A; // проміжний результат (стала частина)
    double B; // проміжний результат (змінна частина)

    cout << "x = ";
    cin >> x;

    // 1. Обчислюємо сталу частину
    A = 1.0 / fabs(x + 2.0) + 1.0;

    // --- Спосіб 1: розгалуження в скороченій формі ---
    if (x < 1)
        B = 7.0 * x * x + x - 8.0;

    if (1 <= x && x <= 4)
        B = 1.0 / tan((x + 4.0) / sqrt(11.0)) + 3.0;

    if (x > 4)
        B = sqrt(1.0 + fabs(pow(cos(x), 3)));

    y = A - B; // Знак мінус перед фігурною дужкою

    cout << endl;
    cout << "1) y = " << y << endl;

    // --- Спосіб 2: розгалуження в повній формі ---
    if (x < 1)
        B = 7.0 * x * x + x - 8.0;
    else if (x > 4)
        B = sqrt(1.0 + fabs(pow(cos(x), 3)));
    else
        B = 1.0 / tan((x + 4.0) / sqrt(11.0)) + 3.0;

    y = A - B;

    cout << "2) y = " << y << endl;

    return 0;
}